{
  "education": [
    {
      "awards_achievements": [
        "N/A"
      ],
      "degree": "Computer Science Technology",
      "department": "Science and Technology",
      "duration": "2020-2023",
      "school_name": "Vanier College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SarahPrimavera",
  "highlighted_projects": [
    {
      "description": "Developed wardrobe management application to track items in closet select outfits. Utilizes technologies such as Flutter and Firebase Cloud for the full stack web application.",
      "git_url": null,
      "name": "Closet Master"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Utilizes bash scripts, psql databases, and docker to track hardware usage of a machine every minute.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Utilizes real-world scenarios to practice various types of SQL queries.",
      "git_url": "/sql",
      "name": "RDBMS and SQL"
    }
  ],
  "name": "Sarah Primavera",
  "others": [
    {
      "bullets": [
        "Name of course: NodeJs Tutorial and Projects Course",
        "Technologies covered: ExpressJS, MongoDB, Mongoose, JWT"
      ],
      "title": "Certificate in NodeJs from Udemy"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Built an automated monitoring service using bash scripts, psql, and docker. This monitoring service looks at how much the hardware is being used and inserts it in the RDBMS",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Morgan Stanley",
      "description": "Built and elevated internal tools for other teams throughout the company. Some of the tools included elevating user experience on web applications by using Angular and AG Grid as well as conducting tests and manipulation of XML SOAP requests",
      "duration": "Jan 2023- May 2023",
      "title": "Software Developer Intern"
    },
    {
      "company": "Vanier College",
      "description": "Created educational science game by integrating Unity 2D and 3D elements while engaging in client meetings to understand requirements and expectations of projects.",
      "duration": "Oct 2022- Mar 2023",
      "title": "Game Developer"
    },
    {
      "company": "Morgan Stanley",
      "description": "Built and elevated internal tools for other teams throughout the company. Some of the tools included developing backend code in Python to create server-side functionalities while using Linux to test and run applications.",
      "duration": "Jun 2022 - Aug 2022",
      "title": "Software Developer Intern"
    },
    {
      "company": "CGI",
      "description": "Facilitated effective communication with customers to provide support and troubleshoot technological issues to ensure a satisfactory resolution to their concerns. ",
      "duration": "Jun 2022 - Aug 2022",
      "title": "Help Desk Technician"
    }
  ],
  "skills": {
    "competent": [
      "Javascript",
      "Nodejs",
      "Angular",
      "Cloud Technologies",
      "HTTP"
    ],
    "familiar": [
      "AWS",
      "Docker",
      "JWT",
      "Jenkins",
      "HTML/CSS"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a dedicated software developer with a diverse background in full-stack development, back-end development, game design and IT support. With experience at Morgan Stanley, I have refined my knowledge of dynamic web solutions using Angular and AG Grid, along with back-end functionalities with Python. At Vanier College, I had the opportunity to collaborate with a client and develop an engaging educational game using Unity 2D and 3D. My technical background spans a wide range of languages including Java, Python, C#, PHP, and Dart, along with knowledge in object-oriented programming, data structures, and design patterns. Some of my projects include a wardrobe management app using Flutter and Dart, along with Firebase Cloud as my database solution. Additionally, I received a certification from Udemy for completing a course in Node.js development to enhance my RESTful API skills. What excites me the most about the software development industry is the continuous learning and dynamic nature of the field. There's never a dull moment. I graduated from Vanier College where I was able to solidify my foundation in programming, databases, and web development. I enjoy leveraging my diverse skill set to create innovative and efficient software solutions."
}
